## 데이터 입출력

In [2]:
import pandas as pd
import numpy as np

### %%writefile 명령(magic)
-  셀에 서술한 내용대로 텍스트 파일을 만드는 명령

In [3]:
%%writefile samples/sample1.csv
c1, c2, c3    # 열 인덱스
1, 1.11, one 
2, 2.22, two
3, 3.33, three

Writing samples/sample1.csv

In [4]:
pd.read_csv('samples/sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

### CSV 파일 입력
- pandas.read_csv : CSV 파일로부터 데이터를 읽어 데이터프레임을 만듬

In [10]:
pd.read_csv('samples/sample1.csv') 
# 열인덱스는 있지만 행 인덱스 정보가 없으므로 0부터 시작하는 정수 인덱스가 자동 추가됨

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [11]:
%%writefile samples/sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample2.csv

In [13]:
# header : index, header 인수를 지정하여 인덱스 및 헤더 출력 여부를 지정하는 것도 가능
pd.read_csv('samples/sample2.csv', header=None) # 헤더부분 출력x

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [14]:
### names :데이터 파일에 열 인덱스 정보가 없는 경우에는 read_csv 명령의 names 인수로 설정
pd.read_csv('samples/sample2.csv', names=['c1', 'c2', 'c3']) #열 인덱스정보 추가

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [15]:
# index_col : 특정한 열을 행 인덱스로 지정하고 싶을때 /특정 칼럼을 인덱스로 줄때
pd.read_csv('samples/sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [16]:
%%writefile samples/sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing samples/sample3.txt

In [ ]:
### 확장자가 CSV가 아닌 파일 즉, 데이터를 구분하는 구분자(separator)가 쉼표(comma)가 아니면 sep 인수를 써서 구분자를 사용자가 지정, 길이가 정해지지 않은 공백이 구분자인 경우에는 \s+ 정규식(regular expression) 문자열을 사용

In [17]:
pd.read_table('samples/sample3.txt', sep='\s+') 
# 일반적인 파일은 이렇게 읽음 sep='\s+': 스페이스가 하나이상

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [18]:
%%writefile samples/sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing samples/sample4.txt

In [19]:
pd.read_csv('samples/sample4.txt', skiprows=[0, 1]) 
# skiprows 인수: 자료 파일 중에 행 중 건너 뛰고 싶을때 사용

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [20]:
%%writefile samples/sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing samples/sample5.csv

In [3]:
# na_values: 특정한 값을 NaN으로 변경하고 싶을때 
# NaN은 실수로 해당 값으로 변경된순간부터 나머지도 실수로 변경됨
df = pd.read_csv('samples/sample5.csv', na_values=['누락', ' '])
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

### CSV 파일 출력
- to_csv 메서드: 파이썬의 데이터프레임 값을 CSV 파일로 출력

In [24]:
df.to_csv('samples/sample6.csv')

In [25]:
df.to_csv('samples/sample7.txt', sep='|')

In [16]:
# na_rep 인수로 NaN 표시값을 바꿀 수도 있다.
df.to_csv('samples/sample8.csv', na_rep='누락')

In [17]:
df.index = ["a", "b", "c"]
df

    c1    c2      c3
a  1.0  1.11     one
b  2.0   NaN     two
c  NaN  3.33   three

In [28]:
df.to_csv('samples/sample9.csv', index=False, header=False)

### 인터넷 상의 CSV 파일 입력

In [29]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [32]:
df.head() # 처음에 있는 데이터 5줄을 보여줌

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [34]:
df.tail() # 뒤에있는 데이터를 보여줌

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q